ezois_ka/oooezoiskaobmen/src/InformationRegisters/НастройкиПодключенияЛокальныхМодулейИСМП/НастройкиПодключенияЛокальныхМодулейИСМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПодключенияЛокальныхМодулейИСМП</name>
  <resources>
    <name>АдресПодключенияЛМ</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОбменНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НастроенныеТоварныеГруппы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоДнейВыгрузкиКарточек</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СерверПодключенияЛМ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПортПодключенияЛМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>DefinedType.Организация</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>DefinedType.РабочиеМестаИС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ezois_ka/oooezoiskaobmen/src/Catalogs/ПодключаемоеОборудование/ПодключаемоеОборудование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПодключаемоеОборудование</name>
  <attributes>
    <name>УстройствоИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодключения</name>
    <type>
      <types>EnumRef.ТипыПодключенияОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>DefinedType.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ДрайверОборудования</name>
    <type>
      <types>CatalogRef.ДрайверыОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБПО</types>
    </type>
  </attributes>
  <attributes>
    <name>Параметры</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособФорматноЛогическогоКонтроля</name>
    <type>
      <types>EnumRef.СпособыФорматноЛогическогоКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеРасхождениеФорматноЛогическогоКонтроля</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяПереустановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоОбмена</name>
    <comment>Предназначен для обмена с оборудованием Offline</comment>
    <type>
      <types>CatalogRef.ПравилаОбменаСПодключаемымОборудованиемOffline</types>
    </type>
  </attributes>
  <attributes>
    <name>УзелИнформационнойБазы</name>
    <comment>Предназначен для обмена с оборудованием Offline</comment>
    <type>
      <types>ExchangePlanRef.ОбменСПодключаемымОборудованиемOffline</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяУстановка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяФискализация</name>
    <comment>Автоматическая фискализация чеков из очереди чеков</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФН36</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВыводитьОтраслевыеРеквизиты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОграничениеДоступа</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>DefinedType.ПользовательБПО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыРегистрации</name>
    <attributes>
      <name>НаименованиеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ezois_ka/oooezoiskaobmen/src/CommonModules/ИнтеграцияТСПИоТ/Module.bsl
#Область ПрограммныйИнтерфейс

// Функция возвращает признак, что проверка разрешительного режима настроена через ТС ПИоТ для ФН.
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
//  ВидПродукции          - ПеречислениеСсылка.ВидыПродукцииИС - вид продукции для отбора
// 
// Возвращаемое значение:
//  Булево - Истина, если для указанного ФН используется проверка кодов маркировки через ТС ПИоТ.
Функция РазрешительныйРежимИспользуетсяПодключениеТСПИоТ(ПараметрыСканирования, ВидПродукции = Неопределено) Экспорт
	
	Если ВидПродукции = Неопределено
		И Не ШтрихкодированиеОбщегоНазначенияИС.ДопустимаПродукцияИСМП(ПараметрыСканирования, Истина) Тогда
		Возврат Ложь;
	ИначеЕсли ВидПродукции <> Неопределено
		И Не ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияИСМП(ВидПродукции, Истина) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыСканирования.ККТФФД12ИСМП) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	НастроеноПодключениеТСПИоТ = ПоПодключаемомуОборудованиюНастроеноПодключениеТСПИоТ(ПараметрыСканирования.ККТФФД12ИСМП, ПараметрыСканирования.НомерФискальногоНакопителя);
	
	Возврат НастроеноПодключениеТСПИоТ;
	
КонецФункции

// Функция возвращает признак, что по указанному ККТ проверка разрешительного режима настроена через ТС ПИоТ.
// 
// Параметры:
//  ККТ - СправочникСсылка.ПодключаемоеОборудование
//  НомерФискальногоНакопителя - Строка
// 
// Возвращаемое значение:
//  Булево - Истина, если для указанного ККТ используется проверка кодов маркировки через ТС ПИоТ.
Функция ПоПодключаемомуОборудованиюНастроеноПодключениеТСПИоТ(ККТ, НомерФискальногоНакопителя) Экспорт
	
	НастроеноПодключениеТСПИоТ = Ложь;
	
	Если ОбщегоНазначенияИСМП.ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ() Тогда
		
		МодульМенеджера = ОбщегоНазначения.ОбщийМодуль("МенеджерОборудованияТСПИоТ");
		НастроенныйТСПИоТ = МодульМенеджера.ПолучитьТСПИоТ(ККТ);
		
		НастроеноПодключениеТСПИоТ = ЗначениеЗаполнено(НастроенныйТСПИоТ);
		
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
			|	НастройкиПодключенияТСПИоТ.НомерФискальногоНакопителя
			|ИЗ
			|	РегистрСведений.НастройкиПодключенияТСПИоТ КАК НастройкиПодключенияТСПИоТ
			|ГДЕ
			|	НастройкиПодключенияТСПИоТ.НомерФискальногоНакопителя = &НомерФискальногоНакопителя";
		
		Запрос.УстановитьПараметр("НомерФискальногоНакопителя", НомерФискальногоНакопителя);
		
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			НастроеноПодключениеТСПИоТ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НастроеноПодключениеТСПИоТ;
	
КонецФункции

// Функция возвращает признак, что проверка разрешительного режима настроена через ТС ПИоТ для ФН.
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
// 
// Возвращаемое значение:
//  Структура - результат проверки настройки:
//   * Настроено - Булево - Истина, если для указанного ФН используется проверка кодов маркировки через ТС ПИоТ
//   * НастройкиПодключения - см. ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ.
Функция НастройкиПодключенияЭкземпляраТСПИоТ(ПараметрыСканирования) Экспорт
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("Настроено",            Ложь);
	СтруктураВозврата.Вставить("НастройкиПодключения", ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ());
	
	Если Не ШтрихкодированиеОбщегоНазначенияИС.ДопустимаПродукцияИСМП(ПараметрыСканирования, Истина) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПараметрыСканирования.НомерФискальногоНакопителя) Тогда
		Возврат СтруктураВозврата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НЕОПРЕДЕЛЕНО                                    КАК ТСПИоТ,
		|	ЛОЖЬ                                            КАК ВнутреннийТСПИоТ,
		|	НастройкиПодключенияТСПИоТ.Адрес                КАК АдресПодключения,
		|	НастройкиПодключенияТСПИоТ.ОбменНаСервере       КАК ОбменНаСервере,
		|	НастройкиПодключенияТСПИоТ.Сервер               КАК Сервер,
		|	НастройкиПодключенияТСПИоТ.Порт                 КАК Порт,
		|	НастройкиПодключенияТСПИоТ.ЗащищенноеСоединение КАК ЗащищенноеСоединение
		|ИЗ
		|	РегистрСведений.НастройкиПодключенияТСПИоТ КАК НастройкиПодключенияТСПИоТ
		|ГДЕ
		|	НастройкиПодключенияТСПИоТ.НомерФискальногоНакопителя = &НомерФискальногоНакопителя";
		
	Если ОбщегоНазначенияИСМП.ВерсияБПОПоддерживаетПроверкуКМЧерезТСПИоТ() Тогда
		
		МодульМенеджера = ОбщегоНазначения.ОбщийМодуль("МенеджерОборудованияТСПИоТ");
		НастроенныйТСПИоТ = МодульМенеджера.ПолучитьТСПИоТ(ПараметрыСканирования.ККТФФД12ИСМП);
		
		Если ЗначениеЗаполнено(НастроенныйТСПИоТ) Тогда
			
			НастройкиПодключения = ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ();
			
			НастройкиПодключения.ПодключаемоеОборудование = ПараметрыСканирования.ККТФФД12ИСМП;
			НастройкиПодключения.ТСПИоТ                   = НастроенныйТСПИоТ;
			
			ИмяПеречисления         = "ТипыТСПИоТ";
			ИмяЗначенияПеречисления = "Внутренний1С";
			
			РеквизитыНастроенногоТСПИоТа = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НастроенныйТСПИоТ,
				"Тип, Сервер, Порт, ЗащищенноеСоединение, Таймаут, ОбменНаСервере, ИсключитьПроверкуКорневыхСертификатов");
			
			НастройкиПодключения.ВнутреннийТСПИоТ = (РеквизитыНастроенногоТСПИоТа.Тип = Перечисления[ИмяПеречисления][ИмяЗначенияПеречисления]);
			
			Если Не НастройкиПодключения.ВнутреннийТСПИоТ Тогда
				ЗаполнитьЗначенияСвойств(НастройкиПодключения, РеквизитыНастроенногоТСПИоТа);
			КонецЕсли;
			
			НастройкиПодключения.АдресПодключения  = СтрШаблон(НСтр("ru = '%1://%2:%3'"), 
				?(РеквизитыНастроенногоТСПИоТа.ЗащищенноеСоединение, "https", "http"), 
				РеквизитыНастроенногоТСПИоТа.Сервер,
				?(ЗначениеЗаполнено(РеквизитыНастроенногоТСПИоТа.Порт), РеквизитыНастроенногоТСПИоТа.Порт, ?(РеквизитыНастроенногоТСПИоТа.ЗащищенноеСоединение, "443", "80")));
			
			СтруктураВозврата.Настроено            = Истина;
			СтруктураВозврата.НастройкиПодключения = НастройкиПодключения;
			
			Возврат СтруктураВозврата;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НомерФискальногоНакопителя", ПараметрыСканирования.НомерФискальногоНакопителя);
	РезультатЗапроса = Запрос.Выполнить();
	
	НастройкиПодключения   = Неопределено;
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		НастройкиПодключения = ОбщегоНазначенияИСМПКлиентСервер.ПараметрыПодключенияТСПИоТ();
		ЗаполнитьЗначенияСвойств(НастройкиПодключения, ВыборкаДетальныеЗаписи);
		
		НастройкиПодключения.ПодключаемоеОборудование              = ПараметрыСканирования.ККТФФД12ИСМП;
		НастройкиПодключения.ИсключитьПроверкуКорневыхСертификатов = Истина;
		
		СтруктураВозврата.Настроено            = Истина;
		СтруктураВозврата.НастройкиПодключения = НастройкиПодключения;
		
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Функция возвращает данные настроек Локального модуля Честный знак по подключаемому оборудованию
//
// Параметры:
//  МассивПодключаемогоОборудования - СправочникСсылка.ПодключаемоеОборудование
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   ПодключаемоеОборудование - СправочникСсылка.ПодключаемоеОборудование
//   АдресЛокальногоМодуля    - Строка
//   Настроено                - Булево
//
Функция НастройкиЛокальногоМодуляЧестныйЗнакПоФискальнымУстройствам(МассивПодключаемогоОборудования) Экспорт
	
	РезультатНастройкиЛМЧЗ = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодключаемоеОборудование.Ссылка       КАК ПодключаемоеОборудование,
		|	ПодключаемоеОборудование.Организация  КАК Организация,
		|	ПодключаемоеОборудование.РабочееМесто КАК РабочееМесто
		|ПОМЕСТИТЬ ВТ_СписокПодключаемогоОборудования
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	ПодключаемоеОборудование.Ссылка В(&МассивСсылок)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СписокПодключаемогоОборудования.ПодключаемоеОборудование     КАК ПодключаемоеОборудование,
		|	НастройкиПодключенияЛокальныхМодулейИСМП.АдресПодключенияЛМ     КАК АдресЛокальногоМодуля,
		|	НЕ НастройкиПодключенияЛокальныхМодулейИСМП.Приоритет ЕСТЬ NULL КАК Настроено
		|ИЗ
		|	ВТ_СписокПодключаемогоОборудования КАК ВТ_СписокПодключаемогоОборудования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПодключенияЛокальныхМодулейИСМП КАК НастройкиПодключенияЛокальныхМодулейИСМП
		|		ПО ВТ_СписокПодключаемогоОборудования.Организация = НастройкиПодключенияЛокальныхМодулейИСМП.Организация
		|			И ВТ_СписокПодключаемогоОборудования.РабочееМесто = НастройкиПодключенияЛокальныхМодулейИСМП.РабочееМесто
		|			И (НастройкиПодключенияЛокальныхМодулейИСМП.Приоритет = 0)";
	
	Запрос.УстановитьПараметр("МассивСсылок", МассивПодключаемогоОборудования);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Подключение = Новый Структура("Настроено, АдресЛокальногоМодуля",
			ВыборкаДетальныеЗаписи.Настроено, ВыборкаДетальныеЗаписи.АдресЛокальногоМодуля);
			
		РезультатНастройкиЛМЧЗ.Вставить(ВыборкаДетальныеЗаписи.ПодключаемоеОборудование, Подключение);
		
	КонецЦикла;
	
	Возврат РезультатНастройкиЛМЧЗ;
	
КонецФункции

// Функция возвращает дополнительные данные для запроса в ТС ПИоТ. Передача этих данных помогает сократить запрос на сервер при
// 		установке ТС ПИоТ на клиенте.
// 
// Параметры:
//  ПараметрыСканирования - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования
// 
// Возвращаемое значение:
//  Структура - Дополнительные данные запроса ТС ПИоТ:
// * Организация                - ОпределяемыйТип.Организация - организация, проверяющая марку
// * ИННОрганизации             - Строка - ИНН организации, проверяющей марку
// * КешОрганизаций             - Соответствие из КлючИЗначение:
// 		** Ключ - ОпределяемыйТип.Организация
// 		** Значение - Строка - ИНН
// * ЛогироватьУспешныеПроверки - Булево - Истина, если требуется логирование успешных операций запросов в РР
// * ДанныеКлиента -  Структура из КлючИЗначение:
//		** НаименованиеКассовогоПО  - Строка - Наименование ПМСР (кассового ПО)
//		** ВерсияКассовогоПО        - Строка - Версия ПМСР (кассового ПО)
//		** ИдентификаторКассовогоПО - Строка - Идентификатор ПМСР (кассового ПО) в реестре ГИС МТ
//		** КонтрольнаяСумма         - Строка - Контрольная сумма/ЭЦП исполняемого файла ПМСР (кассового ПО)
// * ПроверкаЧерезТСПИоТ - Булево - Истина, признак, что проверка идет через ТС ПИоТ.
Функция ДополнительныеДанныеЗапросаТСПИоТ(ПараметрыСканирования) Экспорт
	
	СтруктураДополнительныхПараметров = Новый Структура();
	
	НастройкиСканирования = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.НастройкиСканированияКодовМаркировки();
	РежимыКонтроля        = НастройкаПараметровСканированияСлужебныйКлиентСерверПовтИсп.РежимыКонтроляСредствамиККТ();
	
	ЛогироватьУспешныеПроверки = (НастройкиСканирования.РежимКонтроляСредствамиККТ = РежимыКонтроля.ПередПробитиемЧека)
		И ОбщегоНазначенияИСМППовтИсп.ХранитьУспешныеОперацииПриПроверкеКМ();
	
	ВерсияБГосИС       = ОбщегоНазначенияИС.ВерсияБиблиотеки();
	НаименованиеБГосИС = "БиблиотекаИнтеграцииГосИС";
	
	ДанныеКлиента = Новый Структура();
	ДанныеКлиента.Вставить("НаименованиеКассовогоПО",  НаименованиеБГосИС);                              // Наименование ПМСР (кассового ПО)
	ДанныеКлиента.Вставить("ВерсияКассовогоПО",        ВерсияБГосИС);                                    // Версия ПМСР (кассового ПО)
	ДанныеКлиента.Вставить("ИдентификаторКассовогоПО", ИдентификаторПМСР_ТСПИоТ());                      // Идентификатор ПМСР (кассового ПО) в реестре ГИС МТ
	ДанныеКлиента.Вставить("КонтрольнаяСумма",         ОбщегоНазначенияИС.ХэшСуммаСтроки(ВерсияБГосИС)); // Контрольная сумма/ЭЦП исполняемого файла ПМСР (кассового ПО)
	
	СтруктураДополнительныхПараметров.Вставить("Организация",                ПараметрыСканирования.Организация);
	СтруктураДополнительныхПараметров.Вставить("ИННОрганизации",             "");
	СтруктураДополнительныхПараметров.Вставить("КешОрганизаций",             Новый Соответствие());
	СтруктураДополнительныхПараметров.Вставить("ЛогироватьУспешныеПроверки", ЛогироватьУспешныеПроверки);
	СтруктураДополнительныхПараметров.Вставить("ДанныеКлиента",              ДанныеКлиента);
	СтруктураДополнительныхПараметров.Вставить("ПроверкаЧерезТСПИоТ",        Истина);
	
	СтруктураДополнительныхПараметров.ИННОрганизации = РаботаСКонтрагентамиИСВызовСервера.ИННКПППоОрганизацииКонтрагенту(ПараметрыСканирования.Организация).ИНН;
	СтруктураДополнительныхПараметров.КешОрганизаций.Вставить(ПараметрыСканирования.Организация, СтруктураДополнительныхПараметров.ИННОрганизации);
	
	Возврат СтруктураДополнительныхПараметров;
	
КонецФункции

// Процедура заполняет данные разрешительного режима при розничной продаже с использованием ТС ПИоТ.
// 
// Параметры:
//  ДанныеПоШтрихкодам         - см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки
//  ДанныеКМДляПроверки        - Массив Из СтрокаТабличнойЧасти: см. ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияТаблицыДанныхКодовМаркировки - Коллекция строк таблицы
//  НастройкиПодключенияТСПИоТ - см. НастройкиПодключенияЭкземпляраТСПИоТ
//  ПараметрыСканирования      - см. ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования.
Процедура ЗаполнитьДанныеИдентификатораРозничнойПродажиПоДаннымТСПИоТ(ДанныеПоШтрихкодам, ДанныеКМДляПроверки, НастройкиПодключенияТСПИоТ, ПараметрыСканирования) Экспорт
	
	Если Не НастройкиПодключенияТСПИоТ.Настроено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметрыЗапроса = ДополнительныеДанныеЗапросаТСПИоТ(ПараметрыСканирования);
	
	Если ОбщегоНазначенияИСМПКлиентСерверПовтИсп.ДействуетАварийныйРежимДляРозничныхПродаж() Тогда
		
		Для Каждого СтрокаДанныхПоШтрихкодам Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
			СтрокаДанныхПоШтрихкодам.РазрешительныйРежимКодОтвета = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.АварийныйРежимКодОтветаСервисаГИСМТ();
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	Если Не НастройкиПодключенияТСПИоТ.НастройкиПодключения.ОбменНаСервере Тогда
		
		ДанныеНастройкиТСПИоТ = Новый Структура();
		ДанныеНастройкиТСПИоТ.Вставить("НастройкиПодключенияТСПИоТ", НастройкиПодключенияТСПИоТ);
		ДанныеНастройкиТСПИоТ.Вставить("ДополнительныеПараметры",    ДополнительныеПараметрыЗапроса);
		
		Для Каждого СтрокаДанныхПоШтрихкодам Из ДанныеКМДляПроверки Цикл
			
			СтрокаДанныхПоШтрихкодам.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ = Истина;
			
			Если Не СтрокаДанныхПоШтрихкодам.СтрокаДерева = Неопределено Тогда
				СтрокаДанныхПоШтрихкодам.СтрокаДерева.ТребуетсяПроверкаРазрешительногоРежимаНаТСПИоТ = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
		ДанныеПоШтрихкодам.ДанныеНастройкиТСПИоТ = ДанныеНастройкиТСПИоТ;
		Возврат;
		
	КонецЕсли;
	
	РезультатПроверкиТСПИоТ = ИнтеграцияТСПИоТКлиентСервер.ДанныеПоКодуМаркировкиПриРозничнойПродаже(НастройкиПодключенияТСПИоТ.НастройкиПодключения,
		ДанныеКМДляПроверки,
		ПараметрыСканирования,
		ДополнительныеПараметрыЗапроса);
		
	ШтрихкодированиеОбщегоНазначенияИСМПВызовСервера.ЛогироватьРезультатыОперацийПроверкиКМ(РезультатПроверкиТСПИоТ.ЗапросыДляЛогирования);
	
	Если РезультатПроверкиТСПИоТ.АварийныйРежим Тогда
		
		ОбщегоНазначенияИСМП.ВключитьАварийныйРежимРазрешительнойСистемы();
		
		Для Каждого СтрокаДанныхПоШтрихкодам Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
			СтрокаДанныхПоШтрихкодам.РазрешительныйРежимКодОтвета = ОбщегоНазначенияИСМПКлиентСерверПовтИсп.АварийныйРежимКодОтветаСервисаГИСМТ();
		КонецЦикла;
		
		Возврат;
		
	КонецЕсли;
	
	МассивСтрокДляУдаления = Новый Массив;
	
	Для Каждого СтрокаДанныхПоШтрихкодам Из ДанныеПоШтрихкодам.ДанныеКодовМаркировки Цикл
		
		ПараметрыКодаМаркировкиОнлайн = РезультатПроверкиТСПИоТ.СтатусыКодовМаркировкиГИСМТ.Получить(СтрокаДанныхПоШтрихкодам);
		НаличиеСерыхКодов             = Ложь;
		
		// обработка онлайн запроса
		Если ПараметрыКодаМаркировкиОнлайн <> Неопределено Тогда
			
			Для Каждого КлючИЗначение Из ПараметрыКодаМаркировкиОнлайн Цикл
				
				Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
					Продолжить;
				КонецЕсли;
				
				Если ДанныеПоШтрихкодам.ДанныеКодовМаркировки.Колонки.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаДанныхПоШтрихкодам[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
				
			КонецЦикла;
			
			НаличиеСерыхКодов = ОбщегоНазначенияИСПовтИсп.ЭтоПродукцияМОТП(СтрокаДанныхПоШтрихкодам.ВидПродукции)
				И ПараметрыКодаМаркировкиОнлайн.Свойство("ВСеройЗоне")
				И ПараметрыКодаМаркировкиОнлайн.ВСеройЗоне;
			
			Если НаличиеСерыхКодов Тогда
				
				СтрокаДанныхПоШтрихкодам.КоличествоПотребительскихУпаковок = СтрокаДанныхПоШтрихкодам.ПлановоеКоличествоПотребительскихУпаковок;
				СтрокаДанныхПоШтрихкодам.Количество                        = СтрокаДанныхПоШтрихкодам.ПлановоеКоличествоПотребительскихУпаковок;
				СтрокаДанныхПоШтрихкодам.СодержитСерыеКоды                 = НаличиеСерыхКодов;
				
			КонецЕсли;
			
			// продажа разрешена без ответа разрешительного режима
			СтрокаДанныхПоШтрихкодам.РазрешительныйРежимДатаЗапросаГИСМТ = Формат(ОбщегоНазначенияИС.ДатаВСтрокуUNIX(ТекущаяДатаСеанса()), "ЧРГ=; ЧГ=0;");
			
		Иначе
			
			Если ЗначениеЗаполнено(РезультатПроверкиТСПИоТ.ТекстОшибки) Тогда
				
				СтрокаДанныхПоШтрихкодам.ТекстОшибки = РезультатПроверкиТСПИоТ.ТекстОшибки;
				СтрокаДанныхПоШтрихкодам.КонтролиРазрешительногоРежима.Добавить(СтрокаДанныхПоШтрихкодам.ТекстОшибки);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Коды упаковки были дозагружены из ГИС МТ
		СтрокаДанныхПоШтрихкодам.Идентифицирован = Истина;

		Если СтрокаДанныхПоШтрихкодам.СтрокаДерева = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаДанныхПоШтрихкодам.СтрокаДерева, СтрокаДанныхПоШтрихкодам);
		
		Если Не СтрокаДанныхПоШтрихкодам.ВидУпаковки = Перечисления.ВидыУпаковокИС.Групповая Тогда
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрокаПодчиненнойУпаковки Из СтрокаДанныхПоШтрихкодам.СтрокаДерева.Строки Цикл
			
			СтруктураЗаполнения = Новый Структура();
			СтруктураЗаполнения.Вставить("GTIN",                             Неопределено);
			СтруктураЗаполнения.Вставить("Статус",                           Неопределено);
			СтруктураЗаполнения.Вставить("ИННВладельца",                     Неопределено);
			СтруктураЗаполнения.Вставить("ИННПроизводителя",                 Неопределено);
			СтруктураЗаполнения.Вставить("МРЦ",                              Неопределено);
			СтруктураЗаполнения.Вставить("ПродажаПоДаннымОффлайнРежима",     Неопределено);
			
			СтруктураЗаполнения.Вставить("РазрешительныйРежимИдентификаторЗапросаГИСМТ", Неопределено);
			СтруктураЗаполнения.Вставить("РазрешительныйРежимДатаЗапросаГИСМТ",          Неопределено);
			СтруктураЗаполнения.Вставить("РазрешительныйРежимИдентификаторЭкземпляраПО", Неопределено);
			СтруктураЗаполнения.Вставить("РазрешительныйРежимВерсияБазы",                Неопределено);
			СтруктураЗаполнения.Вставить("РазрешительныйРежимАдресСервера",              Неопределено);
			СтруктураЗаполнения.Вставить("РазрешительныйРежимТелоЗапросаJSON",           Неопределено);
			СтруктураЗаполнения.Вставить("РазрешительныйРежимТелоОтветаJSON",            Неопределено);
			СтруктураЗаполнения.Вставить("РазрешительныйРежимКодОтвета",                 Неопределено);
			
			Если ПараметрыКодаМаркировкиОнлайн <> Неопределено Тогда
				
				ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, ПараметрыКодаМаркировкиОнлайн);
				
				Для Каждого КлючИЗначение Из СтруктураЗаполнения Цикл
				
					Если Не ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
						Продолжить;
					КонецЕсли;
					
					СтруктураПроверки = Новый Структура(КлючИЗначение.Ключ, Null);
					ЗаполнитьЗначенияСвойств(СтруктураПроверки, СтрокаПодчиненнойУпаковки);
					
					Если СтруктураПроверки[КлючИЗначение.Ключ] = Null Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаПодчиненнойУпаковки[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
					
				КонецЦикла;
				
			КонецЕсли;
			
			СтруктураОтбора = Новый Структура("Штрихкод", СтрокаПодчиненнойУпаковки.Штрихкод);
			ДанныеВложеннойУпаковки = ДанныеПоШтрихкодам.ДанныеКодовМаркировки.НайтиСтроки(СтруктураОтбора);
			
			Для Каждого СтруктураВложеннойУпаковки Из ДанныеВложеннойУпаковки Цикл
				
				ЗаполнитьЗначенияСвойств(СтруктураВложеннойУпаковки, СтрокаПодчиненнойУпаковки);
			
				Если НаличиеСерыхКодов И СтрокаДанныхПоШтрихкодам.СодержитСерыеКоды Тогда
					
					МассивСтрокДляУдаления.Добавить(СтруктураВложеннойУпаковки);
					
				КонецЕсли;
			
			КонецЦикла;
			
		КонецЦикла;
		
		Если НаличиеСерыхКодов И СтрокаДанныхПоШтрихкодам.СодержитСерыеКоды Тогда
			СтрокаДанныхПоШтрихкодам.СтрокаДерева.Строки.Очистить();
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого УдаляемаяСтрока Из МассивСтрокДляУдаления Цикл
		ДанныеПоШтрихкодам.ДанныеКодовМаркировки.Удалить(УдаляемаяСтрока);
	КонецЦикла;
	
КонецПроцедуры

// Функция нормализует код маркировки в формате Base64 в вид для передачи в ЛМ ЧЗ
//
// Параметры:
//  ПолныйКодМаркировкиBase64	 - Строка - исходный код
//  ВидПродукции				 - ПеречислениеСсылка.ВидыПродукцииИС - вид продукции
// 
// Возвращаемое значение:
//   - Строка - нормализованный код
//
Функция НормализованныйКодПоПолномуКодуДляПередачиВЛокальныйМодульЧестныйЗнак(ПолныйКодМаркировкиBase64, ВидПродукции) Экспорт
	
	ПолныйКодМаркировки = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.Base64ВШтрихкод(ПолныйКодМаркировкиBase64);
	
	ПараметрыНормализацииМОТП = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
	ПараметрыНормализацииМОТП.ИмяСвойстваКодМаркировки = "Штрихкод";
	ПараметрыНормализацииМОТП.ВключатьМРЦ              = Ложь;
	ПараметрыНормализацииМОТП.НачинаетсяСоСкобки       = Ложь;
	
	ПараметрыНормализацииИСМП = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПараметрыНормализацииКодаМаркировки();
	ПараметрыНормализацииИСМП.ИмяСвойстваКодМаркировки = "Штрихкод";
	ПараметрыНормализацииИСМП.НачинаетсяСоСкобки = Ложь;
	
	Если ОбщегоНазначенияИСКлиентСервер.ЭтоПродукцияМОТП(ВидПродукции) Тогда
		ПараметрыНормализации = ПараметрыНормализацииМОТП;
	ИначеЕсли ОбщегоНазначенияИСКлиентСервер.ЭтоПродукцияИСМП(ВидПродукции, Ложь, Истина) Тогда
		ПараметрыНормализации = ПараметрыНормализацииИСМП;
	Иначе
		Возврат "";
	КонецЕсли;
	
	НормализованныйКод = "";
	
	Попытка
		ДанныеРазбора      = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ПолныйКодМаркировки, ВидПродукции);
		
		Если Не ДанныеРазбора = Неопределено Тогда
			
			НормализованныйКод = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(
				ДанныеРазбора, ВидПродукции, ПараметрыНормализации);
				
		КонецЕсли;
	Исключение
		Возврат НормализованныйКод;
	КонецПопытки;
	
	Возврат НормализованныйКод;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИдентификаторПМСР_ТСПИоТ()
	Возврат "5af4663c-a113-4b47-b959-079ca6dda199";
КонецФункции

#КонецОбласти
